---
title: StructuralSectionGeneralT
classe: Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralT
namespace: Autodesk.Revit.DB.Structure.StructuralSections
eredita: Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionHotRolled
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 9
---

# StructuralSectionGeneralT

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Double FlangeFillet { get; set; }` | `structuralSectionGeneralT.FlangeFillet` | Double |
| `Double FlangeToeOfFillet { get; set; }` | `structuralSectionGeneralT.FlangeToeOfFillet` | Double |
| `Double SlopedFlangeAngle { get; set; }` | `structuralSectionGeneralT.SlopedFlangeAngle` | Double |
| `Double SlopedWebAngle { get; set; }` | `structuralSectionGeneralT.SlopedWebAngle` | Double |
| `Double TopWebFillet { get; set; }` | `structuralSectionGeneralT.TopWebFillet` | Double |
| `Double WebToeOfFillet { get; set; }` | `structuralSectionGeneralT.WebToeOfFillet` | Double |
| `Double GetFlangeThicknessInFlangeCenter()` | `structuralSectionGeneralT.GetFlangeThicknessInFlangeCenter()` | Double |
| `Double GetFlangeThicknessInQuarterWidth()` | `structuralSectionGeneralT.GetFlangeThicknessInQuarterWidth()` | Double |
| `Double GetWebThicknessInHeightCenter()` | `structuralSectionGeneralT.GetWebThicknessInHeightCenter()` | Double |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```